Revit 2022 API
IExportContext Methods
The IExportContext type exposes the following members.
Methods
Name | Description
Finish
 This method is called at the very end of the export process, after all entities were processed (or after the process was cancelled).
IsCanceled
 This method is queried at the beginning of every element.
OnElementBegin
 This method marks the beginning of an element to be exported.
OnElementEnd
 This method marks the end of an element being exported.
OnFaceBegin
 This method marks the beginning of a Face to be exported.
OnFaceEnd
 This method marks the end of the current face being exported.
OnInstanceBegin
 This method marks the beginning of a family instance to be exported.
OnInstanceEnd
 This method marks the end of a family instance being exported.
OnLight
 This method marks the beginning of export of a light which is enabled for rendering.
OnLinkBegin
 This method marks the beginning of a link instance to be exported.
OnLinkEnd
 This method marks the end of a link instance being exported.
OnMaterial
 This method marks a change of the material.
OnPolymesh
 This method is called when a tessellated polymesh of a 3d face is being output.
OnRPC
 This method marks the beginning of export of an RPC object.
OnViewBegin
 This method marks the beginning of a 3D view to be exported.
OnViewEnd
 This method marks the end of a 3D view being exported.
Start
 This method is called at the very start of the export process, still before the first entity of the model was send out.
See Also
IExportContext Interface
Autodesk.Revit.DB Namespace